# series

In [2]:
import numpy as np

In [3]:
import pandas as pd

In [4]:
list = ['a','b','c']

In [5]:
numdata = np.array([10,20,30])

In [6]:
dict = {'a':10,'b':20,'c':30}

In [7]:
pd.Series(list)

0    a
1    b
2    c
dtype: object

In [8]:
pd.Series(numdata)

0    10
1    20
2    30
dtype: int32

In [9]:
pd.Series(dict)

a    10
b    20
c    30
dtype: int64

In [14]:
pd.Series(dict,list)

a    10
b    20
c    30
dtype: int64

In [15]:
ser1 = pd.Series ([2,4,6,8],['usa','uk','pak','aus'])

In [17]:
ser2 = pd.Series([2,4,10,6],['usa','uk','ind','aus'])

In [18]:
ser1

usa    2
uk     4
pak    6
aus    8
dtype: int64

In [19]:
ser2

usa     2
uk      4
ind    10
aus     6
dtype: int64

In [20]:
ser1 + ser2

aus    14.0
ind     NaN
pak     NaN
uk      8.0
usa     4.0
dtype: float64

# Data Frames

In [21]:
from numpy.random import randn

In [22]:
np.random.seed(101)

In [23]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['w','x','y','z'])

In [24]:
df

          w         x         y         z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [25]:
df['w']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: w, dtype: float64

In [26]:
type(df['w'])

pandas.core.series.Series

In [28]:
df[['w','y']]

          w         y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

In [29]:
df['new']= df['w']+df['x']

In [30]:
df

          w         x         y         z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [35]:
df.drop('new',axis = 1)

          w         x         y         z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [36]:
df.drop('B')

          w         x         y         z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [37]:
df

          w         x         y         z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [38]:
# for permaanent drop

In [39]:
df.drop('new',axis=1,inplace=True)

In [40]:
df

          w         x         y         z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [41]:
df.loc['A']

w    2.706850
x    0.628133
y    0.907969
z    0.503826
Name: A, dtype: float64

In [42]:
df.iloc[2]

w   -2.018168
x    0.740122
y    0.528813
z   -0.589001
Name: C, dtype: float64

In [43]:
df.loc['C','y']

0.5288134940893595

In [44]:
df.loc[['A','B'],['w','y']]

          w         y
A  2.706850  0.907969
B  0.651118 -0.848077

In [45]:
df

          w         x         y         z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [46]:
df>0

       w      x      y      z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [47]:
df[df>0]

          w         x         y         z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [48]:
df['w']>0

A     True
B     True
C    False
D     True
E     True
Name: w, dtype: bool

In [49]:
df[df['w']>0]

          w         x         y         z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

Remove row C becuase its not fullfil condition

In [50]:
df[df['z']<0]

          w         x         y         z
C -2.018168  0.740122  0.528813 -0.589001

In [51]:
df

          w         x         y         z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [52]:
booldf = df['w']>0

In [53]:
booldf

A     True
B     True
C    False
D     True
E     True
Name: w, dtype: bool

In [54]:
result = df[booldf]

In [55]:
result

          w         x         y         z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [56]:
mycols=['y','x']

In [57]:
result[mycols]

          y         x
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [63]:
df[df['w']>0][['y','x']]

          y         x
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

# # Missing Values

In [87]:
d = {'a':[1,2,np.nan],'b':[4,np.nan,np.nan],'c':[7,4,3]}

In [88]:
df = pd.DataFrame(d)

In [89]:
df

     a    b  c
0  1.0  4.0  7
1  2.0  NaN  4
2  NaN  NaN  3

In [90]:
df.dropna()

     a    b  c
0  1.0  4.0  7

In [91]:
df.dropna(thresh = 2)

     a    b  c
0  1.0  4.0  7
1  2.0  NaN  4

In [92]:
df.dropna(axis=1)

   c
0  7
1  4
2  3

In [93]:
df

     a    b  c
0  1.0  4.0  7
1  2.0  NaN  4
2  NaN  NaN  3

In [94]:
df.fillna(value=0)

     a    b  c
0  1.0  4.0  7
1  2.0  0.0  4
2  0.0  0.0  3

In [98]:
df['a'].fillna(value=df['a'].mean(),inplace=True)

In [99]:
df

     a    b  c
0  1.0  4.0  7
1  2.0  NaN  4
2  1.5  NaN  3

# Concatenation & Merging

In [100]:
df1= pd.DataFrame({'A':['A0','A1','A2','A3'],'B':['B0','B1','B2','B3'],'C':['C0','C1','C2','C3']})

In [107]:
df2= pd.DataFrame({'A':['A4','A5','A6','A7'],'B':['B4','B5','B6','B7'],'C':['C4','C5','C6','C7']},index=[4,5,6,7])

In [108]:
df1

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3

In [109]:
df2

    A   B   C
4  A4  B4  C4
5  A5  B5  C5
6  A6  B6  C6
7  A7  B7  C7

In [110]:
pd.concat([df1,df2])

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
4  A4  B4  C4
5  A5  B5  C5
6  A6  B6  C6
7  A7  B7  C7

In [111]:
pd.concat([df1,df2], axis=1)

     A    B    C    A    B    C
0   A0   B0   C0  NaN  NaN  NaN
1   A1   B1   C1  NaN  NaN  NaN
2   A2   B2   C2  NaN  NaN  NaN
3   A3   B3   C3  NaN  NaN  NaN
4  NaN  NaN  NaN   A4   B4   C4
5  NaN  NaN  NaN   A5   B5   C5
6  NaN  NaN  NaN   A6   B6   C6
7  NaN  NaN  NaN   A7   B7   C7

In [112]:
left= pd.DataFrame({'key':['k0','k1','k2','k3'],'A':['A0','A1','A2','A3'],'B':['B0','B1','B2','B3']})

In [113]:
right= pd.DataFrame({'key':['k0','k1','k2','k3'],'C':['C0','C1','C2','C3'],'D':['D0','D1','D2','D3']})

In [114]:
left

  key   A   B
0  k0  A0  B0
1  k1  A1  B1
2  k2  A2  B2
3  k3  A3  B3

In [115]:
right

  key   C   D
0  k0  C0  D0
1  k1  C1  D1
2  k2  C2  D2
3  k3  C3  D3

In [116]:
pd.merge(left,right, how='inner', on ='key')

  key   A   B   C   D
0  k0  A0  B0  C0  D0
1  k1  A1  B1  C1  D1
2  k2  A2  B2  C2  D2
3  k3  A3  B3  C3  D3

merge left & right dataframe

# Pandas Operations

In [120]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

In [121]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [122]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [123]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [124]:
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [125]:
def times2(x):
    return x*2

In [126]:
df['col1'].sum()

10

In [127]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [128]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [129]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False